
<!DOCTYPE html
  PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
   <!--
This HTML was auto-generated from MATLAB code.
To make changes, update the MATLAB code and republish this document.
      --><title>Practica 6</title><meta name="generator" content="MATLAB 9.12"><link rel="schema.DC" href="http://purl.org/dc/elements/1.1/"><meta name="DC.date" content="2022-03-26"><meta name="DC.source" content="P6.m"><style type="text/css">
html,body,div,span,applet,object,iframe,h1,h2,h3,h4,h5,h6,p,blockquote,pre,a,abbr,acronym,address,big,cite,code,del,dfn,em,font,img,ins,kbd,q,s,samp,small,strike,strong,tt,var,b,u,i,center,dl,dt,dd,ol,ul,li,fieldset,form,label,legend,table,caption,tbody,tfoot,thead,tr,th,td{margin:0;padding:0;border:0;outline:0;font-size:100%;vertical-align:baseline;background:transparent}body{line-height:1}ol,ul{list-style:none}blockquote,q{quotes:none}blockquote:before,blockquote:after,q:before,q:after{content:'';content:none}:focus{outine:0}ins{text-decoration:none}del{text-decoration:line-through}table{border-collapse:collapse;border-spacing:0}

html { min-height:100%; margin-bottom:1px; }
html body { height:100%; margin:0px; font-family:Arial, Helvetica, sans-serif; font-size:10px; color:#000; line-height:140%; background:#fff none; overflow-y:scroll; }
html body td { vertical-align:top; text-align:left; }

h1 { padding:0px; margin:0px 0px 25px; font-family:Arial, Helvetica, sans-serif; font-size:1.5em; color:#d55000; line-height:100%; font-weight:normal; }
h2 { padding:0px; margin:0px 0px 8px; font-family:Arial, Helvetica, sans-serif; font-size:1.2em; color:#000; font-weight:bold; line-height:140%; border-bottom:1px solid #d6d4d4; display:block; }
h3 { padding:0px; margin:0px 0px 5px; font-family:Arial, Helvetica, sans-serif; font-size:1.1em; color:#000; font-weight:bold; line-height:140%; }

a { color:#005fce; text-decoration:none; }
a:hover { color:#005fce; text-decoration:underline; }
a:visited { color:#004aa0; text-decoration:none; }

p { padding:0px; margin:0px 0px 20px; }
img { padding:0px; margin:0px 0px 20px; border:none; }
p img, pre img, tt img, li img, h1 img, h2 img { margin-bottom:0px; }

ul { padding:0px; margin:0px 0px 20px 23px; list-style:square; }
ul li { padding:0px; margin:0px 0px 7px 0px; }
ul li ul { padding:5px 0px 0px; margin:0px 0px 7px 23px; }
ul li ol li { list-style:decimal; }
ol { padding:0px; margin:0px 0px 20px 0px; list-style:decimal; }
ol li { padding:0px; margin:0px 0px 7px 23px; list-style-type:decimal; }
ol li ol { padding:5px 0px 0px; margin:0px 0px 7px 0px; }
ol li ol li { list-style-type:lower-alpha; }
ol li ul { padding-top:7px; }
ol li ul li { list-style:square; }

.content { font-size:1.2em; line-height:140%; padding: 20px; }

pre, code { font-size:12px; }
tt { font-size: 1.2em; }
pre { margin:0px 0px 20px; }
pre.codeinput { padding:10px; border:1px solid #d3d3d3; background:#f7f7f7; }
pre.codeoutput { padding:10px 11px; margin:0px 0px 20px; color:#4c4c4c; }
pre.error { color:red; }

@media print { pre.codeinput, pre.codeoutput { word-wrap:break-word; width:100%; } }

span.keyword { color:#0000FF }
span.comment { color:#228B22 }
span.string { color:#A020F0 }
span.untermstring { color:#B20000 }
span.syscmd { color:#B28C00 }
span.typesection { color:#A0522D }

.footer { width:auto; padding:10px 0px; margin:25px 0px 0px; border-top:1px dotted #878787; font-size:0.8em; line-height:140%; font-style:italic; color:#878787; text-align:left; float:none; }
.footer p { margin:0px; }
.footer a { color:#878787; }
.footer a:hover { color:#878787; text-decoration:underline; }
.footer a:visited { color:#878787; }

table th { padding:7px 5px; text-align:left; vertical-align:middle; border: 1px solid #d6d4d4; font-weight:bold; }
table td { padding:7px 5px; text-align:left; vertical-align:top; border:1px solid #d6d4d4; }





  </style></head><body><div class="content"><h1>Practica 6</h1><!--introduction--><p>Equipo los difusos</p><!--/introduction--><h2>Contents</h2><div><ul><li><a href="#1">Integrantes</a></li><li><a href="#3">Problema 1</a></li><li><a href="#5">Parametros elegidos</a></li><li><a href="#6">Imagen de la entrada 1</a></li><li><a href="#7">Imagen de la entrada 2</a></li><li><a href="#8">Imagen de la salida</a></li><li><a href="#10">Reglas</a></li><li><a href="#12">Superficie</a></li><li><a href="#14">Problema 3</a></li><li><a href="#15">3.1 &iquest;Qu&eacute; factores explican la presencia de arritmias?</a></li><li><a href="#17">3.2 &iquest;A qu&eacute; se refieren las siglas DSS?</a></li><li><a href="#19">3.3 &iquest;A qu&eacute; se refieren las siglas FLC?</a></li><li><a href="#21">3.4 &iquest;A qu&eacute; se refieren las siglas GA?</a></li><li><a href="#23">3.5 &iquest;Cu&aacute;l es el principal objetivo del cap&iacute;tulo 5?</a></li><li><a href="#25">3.6 La base de datos MIT-BIH Arrhythmia Database contine varios</a></li><li><a href="#27">3.7 &iquest;De qu&eacute; depende el desempe&ntilde;o de un FLC?</a></li><li><a href="#29">3.8 &iquest;Para que utilizan un GA?</a></li><li><a href="#31">3.9 La Figura 1 muestra un diagrama de bloques de la metodolog&iacute;a implementada</a></li><li><a href="#33">3.10 La principal ventaja de un FLC es que no es necesario un modelo</a></li><li><a href="#35">3.11 De la secci&oacute;n 2.2.1 FLC configuraci&oacute;n, &iquest;Cu&aacute;ntas variables ling&uuml;&iacute;sticas se tienen?</a></li><li><a href="#39">3.12 Reporte el diagrama de flujo del GA utilizado.</a></li><li><a href="#42">3.13 Escriba la expresi&oacute;n matem&aacute;tica para el fitness funci&oacute;n utilizada</a></li><li><a href="#45">3.14 No se pretende profundizar sobre el funcionamiento del GA.</a></li><li><a href="#48">3.15 &iquest;Cu&aacute;les fueron los resultados de la implementaci&oacute;n?</a></li></ul></div><h2 id="1">Integrantes</h2><div><ul><li>Sergio Gardu&ntilde;o Jardon</li><li>Robles P. Luis M.</li></ul></div><h2 id="3">Problema 1</h2><p>El problema 1 requiere</p><div><ul><li>2 entradas (servicio y comida)</li><li>El universo de discuros de ambas variables ling&uuml;isticas es 1 salida (propina)</li><li>El universo de discurso de esta variable ling&uacute;istica es [0,15]</li><li>Cada variable ling&uacute;istica dene tener por lo menos cuatro valores ling&uacute;isticos. Por lo menos un valor ling&uacute;istico debe ser una variaci&oacute;n de un primitivo (por ejemplo: muy rica).</li><li>La semantica de cada variable ling&uuml;ista se deja a su "experiencia como consumidor"</li><li>Se tienen que proponer por lo menos cuatro reglas si - entones, para la inferencia difusa (se tiene que utilizar por lo menos una vez cada conjunto difuso propuesto en su sem&aacute;ntica)</li></ul></div><h2 id="5">Parametros elegidos</h2><p>Se opto por agregar 5 funciones de membresia a cada entrada en un rango de 0 a 100</p><h2 id="6">Imagen de la entrada 1</h2><p><img vspace="5" hspace="5" src=" input1.png " alt=""> </p><p>Se muestran 5 funciones de membresia de la entrada "servicio", nombre que matlab no registro correctamente. Las funciones de membresia de la entrada son triangulares</p><h2 id="7">Imagen de la entrada 2</h2><p><img vspace="5" hspace="5" src="input2.png" alt=""> </p><p>La entrada 2, corresponde a la comida y al igual que la entrada 1, esta tiene un rango de 0 a 100. Adem&aacute;s, tiene 5 funciones de membresia tipo triangular, con las variables ling&uuml;isticas: nauseabundo, mala, pasable, rica y deliciosa.</p><h2 id="8">Imagen de la salida</h2><p>Con el fin de variar un poco las funciones de membresia, para la salida se configuraron 4 de estas y se ocup&oacute; curvas de Bell generalizadas como se muestra en la siguiente imagen</p><p><img vspace="5" hspace="5" src="mf_output.png" alt=""> </p><p>La salida en este caso esta limitada a un rango de 0 a 15, con 4 variables semanticas, minima, peque&ntilde;a, buena y fantastica.</p><h2 id="10">Reglas</h2><p>El gran numero de funciones de membresia produjo un total de 5x5=25 reglas que se introdujeron como se muestra en la siguiente imagen</p><p><img vspace="5" hspace="5" src="ruleviewer.png" alt=""> </p><p>en esta vista se puede ver que para una entrada de 82.3 para el servicio y y 91.6 para la comida se obtiene una propina de 10.7, lo cual en si, es la propina que se suele dejar por costumbre.</p><h2 id="12">Superficie</h2><p>Para terminar se muestra la superficie generada por el sistema como complemento visual.</p><p><img vspace="5" hspace="5" src="surface.png" alt=""> </p><p>a partir de la imagen se puede observar que para este sistema un excelente servicio con una nauseabunda comida no supera la propina generada por una comida deliciosa comida con un servicio horrible.</p><h2 id="14">Problema 3</h2><h2 id="15">3.1 &iquest;Qu&eacute; factores explican la presencia de arritmias?</h2><pre>Estas arritmias, derivadas de la disfunci&oacute;n card&iacute;aca, se explican por la
presencia de determinados factores, como los insanos h&aacute;bitos alimenticios,
la falta de actividad f&iacute;sica, el estr&eacute;s elevado, los antecedentes familiares,
la edad y muchos otros</pre><h2 id="17">3.2 &iquest;A qu&eacute; se refieren las siglas DSS?</h2><pre>system has been largely integrated Que es igual a decir Sistema de apoyo a
la decisi&oacute;n.</pre><h2 id="19">3.3 &iquest;A qu&eacute; se refieren las siglas FLC?</h2><pre class="language-matlab">fuzzy <span class="string">logic</span> <span class="string">controllers</span>
</pre><h2 id="21">3.4 &iquest;A qu&eacute; se refieren las siglas GA?</h2><pre class="language-matlab">Genetic <span class="string">algorithms</span>
</pre><h2 id="23">3.5 &iquest;Cu&aacute;l es el principal objetivo del cap&iacute;tulo 5?</h2><p>un m&eacute;todo de clasificaci&oacute;n de arritmias card&iacute;acas basado en el controlador de l&oacute;gica difusa y el algoritmo gen&eacute;tico. El enfoque propuesto se utiliza para clasificar las grabaciones de la base de datos de arritmias del MIT-BIH en cinco casos card&iacute;acos</p><h2 id="25">3.6 La base de datos MIT-BIH Arrhythmia Database contine varios</h2><p>registros de distintos tipos de arritmias, &iquest;Cu&aacute;les son estos? Database recordings into five arrhythmia types: (1) Normal Sinus Rhythm (NSR), (2) Premature Ventricular Contraction (PVC), (3) Left Bundle Branch Block (LBBB), (4) Right Bundle Branch Block (RBBB) and (5) Paced beats (P) (Silva and Moody, 2014). (1) Ritmo sinusal normal (NSR), (2) Contracci&oacute;n ventricular prematura (PVC), (3) Bloqueo de rama izquierda (3) Bloqueo de rama izquierda (BRI), (4) Bloqueo de rama derecha (BRI) y (5) latidos marcados (P) (Silva y Moody, 2014).</p><h2 id="27">3.7 &iquest;De qu&eacute; depende el desempe&ntilde;o de un FLC?</h2><p>dependen del ajuste de los par&aacute;metros de las funciones de pertenencia y de su base de reglas. Para superar este problema, se ofrecieron una serie de enfoques h&iacute;bridos en varios estudios de investigaci&oacute;n, como las t&eacute;cnicas de agrupaci&oacute;n difusa y los algoritmos evolutivos</p><h2 id="29">3.8 &iquest;Para que utilizan un GA?</h2><p>Este sistema debe definir el tipo de arritmia correcto para una muestra previamente desconocida</p><h2 id="31">3.9 La Figura 1 muestra un diagrama de bloques de la metodolog&iacute;a implementada</h2><p>para la clasificaci&oacute;n de arritmias. En nuestro caso nos interesa el bloque de clasificaci&oacute;n. Este est&aacute; compuesto por configuraci&oacute;n y optimizaci&oacute;n. &iquest;En qu&eacute; consisten las entradas (input features) que recibe este bloque de clasificaci&oacute;n? R: clasificar los registros del MIT-BIH en cinco arritmias (NSR, RBBB, LBBB, PVC y P). Este clasificador requiere dos pasos principales que incluyen su configuraci&oacute;n y optimizaci&oacute;n. El FLC propuesto imita el proceso de un controlador est&aacute;ndar.</p><h2 id="33">3.10 La principal ventaja de un FLC es que no es necesario un modelo</h2><p>matem&aacute;tico para la implementaci&oacute;n del controlador (difuso). En general esto es el caso (como en el ejemplo del Problema 2), aunque puede suceder que para resolver cierta clase de problemas sea necesario el modelo matem&aacute;tico de un subsistema. Se espera que la Figura 10 sea transparente en este momento. De acuerdo al texto &iquest;Cu&aacute;l es la diferencia entre la inferencia de Mamdani y Sugeno? R: Para el mecanismo de inferencia de Mamdani mecanismo de inferencia de Mamdani, el antecedente y la consecuencia son variables difusas. Sin embargo, para la inferencia de Sugeno, el antecedente es una variable difusa, pero la consecuencia es una constante o una funci&oacute;n lineal</p><h2 id="35">3.11 De la secci&oacute;n 2.2.1 FLC configuraci&oacute;n, &iquest;Cu&aacute;ntas variables ling&uuml;&iacute;sticas se tienen?</h2><p>N, PVC, P, RBBB, LBBB &iquest;Qu&eacute; tipo de conjuntos difusos son los consecuentes? la Tabla 4, tienen la forma de una expresi&oacute;n condicional expresi&oacute;n condicional que vincula los estados de las caracter&iacute;sticas de entrada como antecedente y las cinco salidas como consecuencias. &iquest;Cu&aacute;ntas reglas si-entones se proponen?</p><p><img vspace="5" hspace="5" src="img1.jpeg" alt=""> </p><p>&iquest;Qu&eacute; sistemas de inferencia se utiliza? interferencia de la l&iacute;nea el&eacute;ctrica, la desviaci&oacute;n de la l&iacute;nea de base, el ruido de contacto de los electrodos, las contracciones musculares, el ruido de la instrumentaci&oacute;n, etc. &iquest;Qu&eacute; operaciones se utilizan para la Conjunci&oacute;n, Disyunci&oacute;n e Implicaci&oacute;n?</p><p><img vspace="5" hspace="5" src="img2.jpeg" alt=""> </p><h2 id="39">3.12 Reporte el diagrama de flujo del GA utilizado.</h2><p>Consta de cuatro bloques principales: la base de conocimientos, el m&eacute;todo de fuzzificaci&oacute;n, el mecanismo de inferencia y el m&eacute;todo de fuzzificaci&oacute;n</p><p><img vspace="5" hspace="5" src="img3.jpeg" alt=""> </p><h2 id="42">3.13 Escriba la expresi&oacute;n matem&aacute;tica para el fitness funci&oacute;n utilizada</h2><p><img vspace="5" hspace="5" src="img4.jpeg" alt=""> </p><h2 id="45">3.14 No se pretende profundizar sobre el funcionamiento del GA.</h2><p>Basta con tener una visi&oacute;n general de su uso en esta implementaci&oacute;n, En particular los par&aacute;metros a optimizar se les da el nombre de cromosomas. En este caso &iquest;Qu&eacute; representan los cromosomas? El cromosoma representa los par&aacute;metros gaussianos (&#956; y &#948;) &iquest;Cu&aacute;les son los resultados del proceso de optimizaci&oacute;n? La tabla 6 muestra los resultados obtenidos, donde MF es la funci&oacute;n de pertenencia, N&uacute;m. fuzzy_set es el n&uacute;mero de conjuntos difusos y Num_R es el n&uacute;mero de reglas difusas. Los valores en negrita indican el FLC adoptadas despu&eacute;s de la optimizaci&oacute;n gen&eacute;tica.</p><p><img vspace="5" hspace="5" src="img5.jpeg" alt=""> </p><h2 id="48">3.15 &iquest;Cu&aacute;les fueron los resultados de la implementaci&oacute;n?</h2><p>La tabla 6 muestra que el RMSE m&iacute;nimo entre las salidas de las FLC y objetivos correspondientes (RMSE&frac14;0.619) se obtiene utilizando tres conjuntos difusos gaussianos y aplicando 62 reglas difusas.</p><p><img vspace="5" hspace="5" src="img6.jpeg" alt=""> </p><p>En consecuencia, la distribuci&oacute;n Este trabajo hace uso de la l&oacute;gica difusa para resolver un problema de clasificaci&oacute;n, que es una de las varias aplicaciones de la l&oacute;gica difusa.</p><p class="footer"><br><a href="https://www.mathworks.com/products/matlab/">Published with MATLAB&reg; R2022a</a><br></p></div><!--
##### SOURCE BEGIN #####
%% Practica 6
% Equipo los difusos
%% Integrantes
%%
% 
% * Sergio Garduño Jardon
% * Robles P. Luis M.
% 


%% Problema 1
% El problema 1 requiere
%%
% 
% * 2 entradas (servicio y comida)
% * El universo de discuros de ambas variables lingüisticas es 1 salida (propina)
% * El universo de discurso de esta variable lingúistica es [0,15] 
% * Cada variable lingúistica dene tener por lo menos cuatro valores lingúisticos. Por lo menos un valor lingúistico debe ser una variación de un primitivo (por ejemplo: muy rica).
% * La semantica de cada variable lingüista se deja a su "experiencia como consumidor"
% * Se tienen que proponer por lo menos cuatro reglas si - entones, para la inferencia difusa (se tiene que utilizar por lo menos una vez cada conjunto difuso propuesto en su semántica)
%
%% Parametros elegidos
% Se opto por agregar 5 funciones de membresia a cada entrada en un rango
% de 0 a 100
% 
%% Imagen de la entrada 1
% 
% << input1.png >>
% 
% Se muestran 5 funciones de membresia de la entrada "servicio", 
% nombre que matlab no registro correctamente.
% Las funciones de membresia de la entrada son triangulares  
%
%% Imagen de la entrada 2
% 
% 
% <<input2.png>>
% 
% La entrada 2, corresponde a la comida y al igual que la entrada 1, esta 
% tiene un rango de 0 a 100. Además, tiene 5 funciones de membresia tipo
% triangular, con las variables lingüisticas: nauseabundo, mala, pasable,
% rica y deliciosa.
%% Imagen de la salida
% Con el fin de variar un poco las funciones de membresia, para la salida
% se configuraron 4 de estas y se ocupó curvas de Bell generalizadas
% como se muestra en la siguiente imagen
%%
% 
% <<mf_output.png>>
% 
% La salida en este caso esta limitada a un rango de 0 a 15, con 4
% variables semanticas, minima, pequeña, buena y fantastica.
%% Reglas
% El gran numero de funciones de membresia produjo un total de 5x5=25
% reglas que se introdujeron como se muestra en la siguiente imagen
%%
% 
% <<ruleviewer.png>>
% 
% en esta vista se puede ver que para una entrada de 82.3 para el servicio y
% y 91.6 para la comida se obtiene una propina de 10.7, lo cual en si, es
% la propina que se suele dejar por costumbre.
%% Superficie
% Para terminar se muestra la superficie generada por el sistema como
% complemento visual.
%%
% 
% <<surface.png>>
% 
% a partir de la imagen se puede observar que para este sistema un
% excelente servicio con una nauseabunda comida no supera la propina
% generada por una comida deliciosa comida con un servicio horrible.

%% Problema 3
% 
%
% 
%% 3.1 ¿Qué factores explican la presencia de arritmias?
%  Estas arritmias, derivadas de la disfunción cardíaca, se explican por la
%  presencia de determinados factores, como los insanos hábitos alimenticios, 
% la falta de actividad física, el estrés elevado, los antecedentes familiares, 
% la edad y muchos otros
%%
%% 3.2 ¿A qué se refieren las siglas DSS?
%  system has been largely integrated Que es igual a decir Sistema de apoyo a 
%  la decisión.
%%
%% 3.3 ¿A qué se refieren las siglas FLC?
%   fuzzy logic controllers
%% 
%% 3.4 ¿A qué se refieren las siglas GA?
%   Genetic algorithms
%%
%% 3.5 ¿Cuál es el principal objetivo del capítulo 5?
% un método de clasificación de arritmias cardíacas basado en el controlador 
% de lógica difusa y el algoritmo genético. El enfoque propuesto se utiliza
% para clasificar las grabaciones de la base de datos de arritmias del
% MIT-BIH en cinco casos cardíacos
%%
%% 3.6 La base de datos MIT-BIH Arrhythmia Database contine varios 
% registros de distintos tipos de arritmias, ¿Cuáles son estos? 
% Database recordings into five arrhythmia types: (1) 
% Normal Sinus Rhythm (NSR), (2) Premature Ventricular Contraction (PVC), 
% (3) Left Bundle Branch Block (LBBB), (4) Right Bundle Branch Block (RBBB)
% and (5) Paced beats (P) (Silva and Moody, 2014).
% (1) Ritmo sinusal normal (NSR), (2) Contracción ventricular prematura (PVC),
% (3) Bloqueo de rama izquierda (3) Bloqueo de rama izquierda (BRI),
% (4) Bloqueo de rama derecha (BRI) y (5) latidos marcados (P) (Silva y Moody, 2014).
%%
%% 3.7 ¿De qué depende el desempeño de un FLC?
% dependen del ajuste de los parámetros de las funciones de pertenencia y 
% de su base de reglas. Para superar este problema, se ofrecieron una serie 
% de enfoques híbridos en varios estudios de investigación, como las técnicas
% de agrupación difusa y los algoritmos evolutivos
%%
%% 3.8 ¿Para que utilizan un GA?
% Este sistema debe definir el tipo de arritmia correcto para una muestra 
% previamente desconocida
%%
%% 3.9 La Figura 1 muestra un diagrama de bloques de la metodología implementada 
% para la clasificación de arritmias. En nuestro caso nos interesa el bloque de 
% clasificación. Este está compuesto por configuración y optimización. 
% ¿En qué consisten las entradas (input features) que recibe este bloque de clasificación? 
% R: clasificar los registros del MIT-BIH en cinco arritmias (NSR, RBBB, LBBB, PVC y P). 
% Este clasificador requiere dos pasos principales que incluyen su configuración y optimización. 
% El FLC propuesto imita el proceso de un controlador estándar.
%%
%% 3.10 La principal ventaja de un FLC es que no es necesario un modelo 
% matemático para la implementación del controlador (difuso). 
% En general esto es el caso (como en el ejemplo del Problema 2), 
% aunque puede suceder que para resolver cierta clase de problemas sea 
% necesario el modelo matemático de un subsistema. Se espera que la
% Figura 10 sea transparente en este momento. De acuerdo al texto 
% ¿Cuál es la diferencia entre la inferencia de Mamdani y Sugeno?
% R: Para el mecanismo de inferencia de Mamdani mecanismo de inferencia de
% Mamdani, el antecedente y la consecuencia son variables difusas. 
% Sin embargo, para la inferencia de Sugeno, el antecedente es una variable
% difusa, pero la consecuencia es una constante o una función lineal
%%
%% 3.11 De la sección 2.2.1 FLC configuración, ¿Cuántas variables lingüísticas se tienen? 
% N, PVC, P, RBBB, LBBB 
% ¿Qué tipo de conjuntos difusos son los consecuentes? 
% la Tabla 4, tienen la forma de una expresión condicional expresión condicional 
% que vincula los estados de las características de entrada como antecedente 
% y las cinco salidas como consecuencias.
% ¿Cuántas reglas si-entones se proponen?
%%
% 
% <<img1.jpeg>>
% 
% ¿Qué sistemas de inferencia se utiliza? 
% interferencia de la línea eléctrica, la desviación de la línea de base, 
% el ruido de contacto de los electrodos, las contracciones musculares, el ruido de la instrumentación, etc.
% ¿Qué operaciones se utilizan para la Conjunción, Disyunción e Implicación?
%%
% 
% <<img2.jpeg>>
% 
%%
%% 3.12 Reporte el diagrama de flujo del GA utilizado.
% Consta de cuatro bloques principales: la base de conocimientos, el método de fuzzificación, el mecanismo de inferencia y el método de fuzzificación
%%
% 
% <<img3.jpeg>>
% 
%%
%% 3.13 Escriba la expresión matemática para el fitness función utilizada
%%
% 
% <<img4.jpeg>>
%   
%%
%%  3.14 No se pretende profundizar sobre el funcionamiento del GA. 
% Basta con tener una visión general de su uso en esta implementación, 
% En particular los parámetros a optimizar se les da el nombre de cromosomas. 
% En este caso 
% ¿Qué representan los cromosomas? 
% El cromosoma representa los parámetros gaussianos (μ y δ) 
% ¿Cuáles son los resultados del proceso de optimización?
% La tabla 6 muestra los resultados obtenidos, donde MF es la función de pertenencia, Núm. 
% fuzzy_set es el número de conjuntos difusos y Num_R es el número de reglas difusas. 
% Los valores en negrita indican el FLC adoptadas después de la optimización genética.
%%
% 
% <<img5.jpeg>>
% 

%%
%%  3.15 ¿Cuáles fueron los resultados de la implementación?
% La tabla 6 muestra que el RMSE mínimo entre las salidas de las FLC y 
% objetivos correspondientes (RMSE¼0.619) se obtiene utilizando tres 
% conjuntos difusos gaussianos y aplicando 62 reglas difusas. 
%%
% 
% <<img6.jpeg>>
% 
% En consecuencia, la distribución
% Este trabajo hace uso de la lógica difusa para resolver un problema de
% clasificación, que es una de las varias aplicaciones de la lógica difusa. 

##### SOURCE END #####
--></body></html>